import { NativeModules } from 'react-native';

type SocketConfig = {
  name?: string;
  type: number;
  host: string;
  port: number;
  username?: string; // 仅 HTTP 支持
  password?: string; // 仅 SHADOWSOCKS / HTTP 支持
  method?: string; // 仅 SHADOWSOCKS 支持
  udpRelay?: boolean; // 是否支持 udp relay
  dnsServer?: string; // DNS server
  vpnMode?: number; // VPN 模式，分为全局，白名单，黑名单
  applications?: Array<string>; // 应用 packageName 列表，白名单或者黑名单
  mergeDefaultRoute?: boolean; // 设置是否合并使用系统设定的路由。如果不使用且未设置routes，则默认使用 0.0.0.0/0 全部都走VPN
  routes?: Array<string>; // 设置经过VPN的路由
};

// 系统设定的路由
export const DEFAULT_ROUTES = [
  '1.0.0.0/8',
  '2.0.0.0/7',
  '4.0.0.0/6',
  '8.0.0.0/7',
  '11.0.0.0/8',
  '12.0.0.0/6',
  '16.0.0.0/4',
  '32.0.0.0/3',
  '64.0.0.0/3',
  '96.0.0.0/6',
  '100.0.0.0/10',
  '100.128.0.0/9',
  '101.0.0.0/8',
  '102.0.0.0/7',
  '104.0.0.0/5',
  '112.0.0.0/5',
  '120.0.0.0/6',
  '124.0.0.0/7',
  '126.0.0.0/8',
  '128.0.0.0/3',
  '160.0.0.0/5',
  '168.0.0.0/8',
  '169.0.0.0/9',
  '169.128.0.0/10',
  '169.192.0.0/11',
  '169.224.0.0/12',
  '169.240.0.0/13',
  '169.248.0.0/14',
  '169.252.0.0/15',
  '169.255.0.0/16',
  '170.0.0.0/7',
  '172.0.0.0/12',
  '172.32.0.0/11',
  '172.64.0.0/10',
  '172.128.0.0/9',
  '173.0.0.0/8',
  '174.0.0.0/7',
  '176.0.0.0/4',
  '192.0.1.0/24',
  '192.0.3.0/24',
  '192.0.4.0/22',
  '192.0.8.0/21',
  '192.0.16.0/20',
  '192.0.32.0/19',
  '192.0.64.0/18',
  '192.0.128.0/17',
  '192.1.0.0/16',
  '192.2.0.0/15',
  '192.4.0.0/14',
  '192.8.0.0/13',
  '192.16.0.0/13',
  '192.24.0.0/14',
  '192.28.0.0/15',
  '192.30.0.0/16',
  '192.31.0.0/17',
  '192.31.128.0/18',
  '192.31.192.0/22',
  '192.31.197.0/24',
  '192.31.198.0/23',
  '192.31.200.0/21',
  '192.31.208.0/20',
  '192.31.224.0/19',
  '192.32.0.0/12',
  '192.48.0.0/14',
  '192.52.0.0/17',
  '192.52.128.0/18',
  '192.52.192.0/24',
  '192.52.194.0/23',
  '192.52.196.0/22',
  '192.52.200.0/21',
  '192.52.208.0/20',
  '192.52.224.0/19',
  '192.53.0.0/16',
  '192.54.0.0/15',
  '192.56.0.0/13',
  '192.64.0.0/12',
  '192.80.0.0/13',
  '192.88.0.0/18',
  '192.88.64.0/19',
  '192.88.96.0/23',
  '192.88.98.0/24',
  '192.88.100.0/22',
  '192.88.104.0/21',
  '192.88.112.0/20',
  '192.88.128.0/17',
  '192.89.0.0/16',
  '192.90.0.0/15',
  '192.92.0.0/14',
  '192.96.0.0/11',
  '192.128.0.0/11',
  '192.160.0.0/13',
  '192.169.0.0/16',
  '192.170.0.0/15',
  '192.172.0.0/15',
  '192.174.0.0/16',
  '192.175.0.0/19',
  '192.175.32.0/20',
  '192.175.49.0/24',
  '192.175.50.0/23',
  '192.175.52.0/22',
  '192.175.56.0/21',
  '192.175.64.0/18',
  '192.175.128.0/17',
  '192.176.0.0/12',
  '192.192.0.0/10',
  '193.0.0.0/8',
  '194.0.0.0/7',
  '196.0.0.0/7',
  '198.0.0.0/12',
  '198.16.0.0/15',
  '198.20.0.0/14',
  '198.24.0.0/13',
  '198.32.0.0/12',
  '198.48.0.0/15',
  '198.50.0.0/16',
  '198.51.0.0/18',
  '198.51.64.0/19',
  '198.51.96.0/22',
  '198.51.101.0/24',
  '198.51.102.0/23',
  '198.51.104.0/21',
  '198.51.112.0/20',
  '198.51.128.0/17',
  '198.52.0.0/14',
  '198.56.0.0/13',
  '198.64.0.0/10',
  '198.128.0.0/9',
  '199.0.0.0/8',
  '200.0.0.0/7',
  '202.0.0.0/8',
  '203.0.0.0/18',
  '203.0.64.0/19',
  '203.0.96.0/20',
  '203.0.112.0/24',
  '203.0.114.0/23',
  '203.0.116.0/22',
  '203.0.120.0/21',
  '203.0.128.0/17',
  '203.1.0.0/16',
  '203.2.0.0/15',
  '203.4.0.0/14',
  '203.8.0.0/13',
  '203.16.0.0/12',
  '203.32.0.0/11',
  '203.64.0.0/10',
  '203.128.0.0/9',
  '204.0.0.0/6',
  '208.0.0.0/4',
];

export const APPLICATION_MODE = {
  GLOBAL_MODE: 0,
  WHITELIST_MODE: 1,
  BLACKLIST_MODE: 2,
};

export const ErrorCode = {
  NO_ERROR: 0,
  UNEXPECTED: 1,
  VPN_PERMISSION_NOT_GRANTED: 2,
  INVALID_SERVER_CREDENTIALS: 3,
  UDP_RELAY_NOT_ENABLED: 4,
  SERVER_UNREACHABLE: 5,
  VPN_START_FAILURE: 6,
  ILLEGAL_SERVER_CONFIGURATION: 7,
  SHADOWSOCKS_START_FAILURE: 8,
  CONFIGURE_SYSTEM_PROXY_FAILURE: 9,
  NO_ADMIN_PERMISSIONS: 10,
  UNSUPPORTED_ROUTING_TABLE: 11,
  SYSTEM_MISCONFIGURED: 12,
};

export const TunnelStatus = {
  INVALID: -1, // Internal use only.
  DISCONNECTED: 0,
  CONNECTING: 1,
  CONNECTED: 2,
  RECONNECTING: 3,
};

export const SocketType = {
  SHADOWSOCKS: 0, // sslocal.so 提供支持
  SOCKS5: 1, // 暂不支持鉴权
  HTTP: 2, // 支持鉴权
};

type Vpn2sockType = {
  startTunnel(tunnelId: string, config: SocketConfig): Promise<boolean>;
  stopTunnel(tunnelId: string): Promise<boolean>;
  getActivedTunnelId(): Promise<string>;
  getTunnelStatus(): Promise<number>;
  isRunning(tunnelId: string): Promise<boolean>;
  isReachable(host: string, port: number): Promise<boolean>;
  getPackageList(): Promise<Array<Object>>;
};

const { Vpn2sock } = NativeModules;

export default Vpn2sock as Vpn2sockType;
